Revit 2024 API
BuiltInFailures.AutoRouteFailures.DesignOptionConflictError Property
 The solution is failing to do the elements are not in the same Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DesignOptionConflictError { get; }
Visual Basic
Public Shared ReadOnly Property DesignOptionConflictError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DesignOptionConflictError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace